hrzhao@login25:/workspace/ActsExaTrkXTritonBackend$ tritonserver --model-repository=model_repo/ --log-verbose=4 | tee log.lunch.txt
I0117 13:56:58.409806 572101 shared_library.cc:108] OpenLibraryHandle: /opt/tritonserver/backends/pytorch/libtriton_pytorch.so
I0117 13:56:58.530433 572101 triton_backend_manager.cc:101] unloading backend 'pytorch'
I0117 13:56:59.029747 572101 pinned_memory_manager.cc:240] Pinned memory pool is created at '0x7f1a66000000' with size 268435456
I0117 13:56:59.033031 572101 cuda_memory_manager.cc:105] CUDA memory pool is created on device 0 with size 67108864
I0117 13:56:59.037939 572101 model_config_utils.cc:667] Server side auto-completed config: name: "ActsExaTrkX"
input {
  name: "FEATURES"
  data_type: TYPE_FP32
  dims: -1
  dims: 3
}
output {
  name: "LABELS"
  data_type: TYPE_INT64
  dims: -1
}
instance_group {
  count: 1
  kind: KIND_GPU
}
parameters {
  key: "EXECUTION_MODEL_PATH"
  value {
    string_value: "/pscratch/sd/h/hrzhao/Projects/exatrkx-acts-demonstrator/models/smeared_hits/"
  }
}
backend: "ActsExaTrkX"

I0117 13:56:59.041091 572101 model_repository_manager.cc:700] AsyncLoad() 'ActsExaTrkX'
I0117 13:56:59.041169 572101 model_repository_manager.cc:939] TriggerNextAction() 'ActsExaTrkX' version 1: 1
I0117 13:56:59.041180 572101 model_repository_manager.cc:975] Load() 'ActsExaTrkX' version 1
I0117 13:56:59.041188 572101 model_repository_manager.cc:994] loading: ActsExaTrkX:1
I0117 13:56:59.141455 572101 model_repository_manager.cc:1052] CreateModel() 'ActsExaTrkX' version 1
I0117 13:56:59.141573 572101 shared_library.cc:108] OpenLibraryHandle: model_repo/ActsExaTrkX/libtriton_ActsExaTrkX.so
I0117 13:56:59.656587 572101 ActsExaTrkX.cc:71] TRITONBACKEND_Initialize: ActsExaTrkX
I0117 13:56:59.657080 572101 ActsExaTrkX.cc:83] Triton TRITONBACKEND API version: 1.8
I0117 13:56:59.657093 572101 ActsExaTrkX.cc:89] 'ActsExaTrkX' TRITONBACKEND API version: 1.8
I0117 13:56:59.657099 572101 ActsExaTrkX.cc:115] backend configuration:
{}
I0117 13:56:59.658338 572101 model_config_utils.cc:1616] ModelConfig 64-bit fields:
I0117 13:56:59.658350 572101 model_config_utils.cc:1618]        ModelConfig::dynamic_batching::default_queue_policy::default_timeout_microseconds
I0117 13:56:59.658359 572101 model_config_utils.cc:1618]        ModelConfig::dynamic_batching::max_queue_delay_microseconds
I0117 13:56:59.658365 572101 model_config_utils.cc:1618]        ModelConfig::dynamic_batching::priority_queue_policy::value::default_timeout_microseconds
I0117 13:56:59.658372 572101 model_config_utils.cc:1618]        ModelConfig::ensemble_scheduling::step::model_version
I0117 13:56:59.658378 572101 model_config_utils.cc:1618]        ModelConfig::input::dims
I0117 13:56:59.658383 572101 model_config_utils.cc:1618]        ModelConfig::input::reshape::shape
I0117 13:56:59.658389 572101 model_config_utils.cc:1618]        ModelConfig::instance_group::secondary_devices::device_id
I0117 13:56:59.658394 572101 model_config_utils.cc:1618]        ModelConfig::model_warmup::inputs::value::dims
I0117 13:56:59.658401 572101 model_config_utils.cc:1618]        ModelConfig::optimization::cuda::graph_spec::graph_lower_bound::input::value::dim
I0117 13:56:59.658407 572101 model_config_utils.cc:1618]        ModelConfig::optimization::cuda::graph_spec::input::value::dim
I0117 13:56:59.658414 572101 model_config_utils.cc:1618]        ModelConfig::output::dims
I0117 13:56:59.658419 572101 model_config_utils.cc:1618]        ModelConfig::output::reshape::shape
I0117 13:56:59.658425 572101 model_config_utils.cc:1618]        ModelConfig::sequence_batching::direct::max_queue_delay_microseconds
I0117 13:56:59.658431 572101 model_config_utils.cc:1618]        ModelConfig::sequence_batching::max_sequence_idle_microseconds
I0117 13:56:59.658436 572101 model_config_utils.cc:1618]        ModelConfig::sequence_batching::oldest::max_queue_delay_microseconds
I0117 13:56:59.658442 572101 model_config_utils.cc:1618]        ModelConfig::sequence_batching::state::dims
I0117 13:56:59.658449 572101 model_config_utils.cc:1618]        ModelConfig::sequence_batching::state::initial_state::dims
I0117 13:56:59.658455 572101 model_config_utils.cc:1618]        ModelConfig::version_policy::specific::versions
I0117 13:56:59.658983 572101 ActsExaTrkX.cc:332] model configuration:
{
    "name": "ActsExaTrkX",
    "platform": "",
    "backend": "ActsExaTrkX",
    "version_policy": {
        "latest": {
            "num_versions": 1
        }
    },
    "max_batch_size": 0,
    "input": [
        {
            "name": "FEATURES",
            "data_type": "TYPE_FP32",
            "format": "FORMAT_NONE",
            "dims": [
                -1,
                3
            ],
            "is_shape_tensor": false,
            "allow_ragged_batch": false,
            "optional": false
        }
    ],
    "output": [
        {
            "name": "LABELS",
            "data_type": "TYPE_INT64",
            "dims": [
                -1
            ],
            "label_filename": "",
            "is_shape_tensor": false
        }
    ],
    "batch_input": [],
    "batch_output": [],
    "optimization": {
        "priority": "PRIORITY_DEFAULT",
        "input_pinned_memory": {
            "enable": true
        },
        "output_pinned_memory": {
            "enable": true
        },
        "gather_kernel_buffer_threshold": 0,
        "eager_batching": false
    },
    "instance_group": [
        {
            "name": "ActsExaTrkX_0",
            "kind": "KIND_GPU",
            "count": 1,
            "gpus": [
                0
            ],
            "secondary_devices": [],
            "profile": [],
            "passive": false,
            "host_policy": ""
        }
    ],
    "default_model_filename": "",
    "cc_model_filenames": {},
    "metric_tags": {},
    "parameters": {
        "EXECUTION_MODEL_PATH": {
            "string_value": "/pscratch/sd/h/hrzhao/Projects/exatrkx-acts-demonstrator/models/smeared_hits/"
        }
    },
    "model_warmup": []
}
I0117 13:56:59.659044 572101 ActsExaTrkX.cc:251] Using the model path: /pscratch/sd/h/hrzhao/Projects/exatrkx-acts-demonstrator/models/smeared_hits/
I0117 13:56:59.659052 572101 ActsExaTrkX.cc:272] Change the model_type to: acts-smear for smeared_hits model(embeddingDim = 12)
05:56:59    MetricLearni   DEBUG     Using torch version 1.13.1
05:57:02    FilterModel    DEBUG     Using torch version 1.13.1
05:57:02    GNNModel       DEBUG     Using torch version 1.13.1
I0117 13:57:02.477058 572101 triton_backend_manager.cc:101] unloading backend 'ActsExaTrkX'
I0117 13:57:02.477079 572101 ActsExaTrkX.cc:139] TRITONBACKEND_Finalize: state is 'backend state'
E0117 13:57:02.477487 572101 model_repository_manager.cc:1152] failed to load 'ActsExaTrkX' version 1: Internal: GPU instances not supported
I0117 13:57:02.477499 572101 model_repository_manager.cc:939] TriggerNextAction() 'ActsExaTrkX' version 1: 0
I0117 13:57:02.477508 572101 model_repository_manager.cc:953] no next action, trigger OnComplete()
I0117 13:57:02.477557 572101 model_repository_manager.cc:546] VersionStates() 'ActsExaTrkX'
I0117 13:57:02.477611 572101 model_repository_manager.cc:546] VersionStates() 'ActsExaTrkX'
I0117 13:57:02.477645 572101 server.cc:522]
+------------------+------+
| Repository Agent | Path |
+------------------+------+
+------------------+------+

I0117 13:57:02.477669 572101 server.cc:549]
+---------+------+--------+
| Backend | Path | Config |
+---------+------+--------+
+---------+------+--------+

I0117 13:57:02.477681 572101 model_repository_manager.cc:522] ModelStates()
I0117 13:57:02.477714 572101 server.cc:592]
+-------------+---------+----------------------------------------------------+
| Model       | Version | Status                                             |
+-------------+---------+----------------------------------------------------+
| ActsExaTrkX | 1       | UNAVAILABLE: Internal: GPU instances not supported |
+-------------+---------+----------------------------------------------------+

I0117 13:57:02.511573 572101 metrics.cc:623] Collecting metrics for GPU 0: NVIDIA A100-PCIE-40GB
I0117 13:57:02.511822 572101 tritonserver.cc:1932]
+----------------------------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Option                           | Value                                                                                                                                                                                        |
+----------------------------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| server_id                        | triton                                                                                                                                                                                       |
| server_version                   | 2.19.0                                                                                                                                                                                       |
| server_extensions                | classification sequence model_repository model_repository(unload_dependents) schedule_policy model_configuration system_shared_memory cuda_shared_memory binary_tensor_data statistics trace |
| model_repository_path[0]         | model_repo/                                                                                                                                                                                  |
| model_control_mode               | MODE_NONE                                                                                                                                                                                    |
| strict_model_config              | 1                                                                                                                                                                                            |
| rate_limit                       | OFF                                                                                                                                                                                          |
| pinned_memory_pool_byte_size     | 268435456                                                                                                                                                                                    |
| cuda_memory_pool_byte_size{0}    | 67108864                                                                                                                                                                                     |
| response_cache_byte_size         | 0                                                                                                                                                                                            |
| min_supported_compute_capability | 6.0                                                                                                                                                                                          |
| strict_readiness                 | 1                                                                                                                                                                                            |
| exit_timeout                     | 30                                                                                                                                                                                           |
+----------------------------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

I0117 13:57:02.511856 572101 server.cc:252] Waiting for in-flight requests to complete.
I0117 13:57:02.511863 572101 model_repository_manager.cc:645] AsyncUnload() 'ActsExaTrkX'
I0117 13:57:02.511869 572101 model_repository_manager.cc:939] TriggerNextAction() 'ActsExaTrkX' version 1: 2
I0117 13:57:02.511876 572101 model_repository_manager.cc:1019] Unload() 'ActsExaTrkX' version 1
I0117 13:57:02.511886 572101 model_repository_manager.cc:486] LiveModelStates()
I0117 13:57:02.511893 572101 server.cc:267] Timeout 30: Found 0 live models and 0 in-flight non-inference requests
error: creating server: Internal - failed to load all models
